Revit.Elements.Views.Sheet
A Revit ViewSheet

Revit.Elements.Views.Sheet.#ctor(Autodesk.Revit.DB.ViewSheet)
Private constructor

Revit.Elements.Views.Sheet.#ctor(System.String,System.String,System.Collections.Generic.IEnumerable{Autodesk.Revit.DB.View})
Private constructor

Revit.Elements.Views.Sheet.#ctor(System.String,System.String,Autodesk.Revit.DB.FamilySymbol,System.Collections.Generic.IEnumerable{Autodesk.Revit.DB.View})
Private constructor.
sheetName:
sheetNumber:
titleBlockFamilySymbol:
views:

Revit.Elements.Views.Sheet.InitSheet(Autodesk.Revit.DB.ViewSheet)
Initialize a Sheet element

Revit.Elements.Views.Sheet.InitSheet(System.String,System.String,System.Collections.Generic.IEnumerable{Autodesk.Revit.DB.View})
Initialize a Sheet element

Revit.Elements.Views.Sheet.InitSheet(System.String,System.String,Autodesk.Revit.DB.FamilySymbol,System.Collections.Generic.IEnumerable{Autodesk.Revit.DB.View})
Initialize a Sheet element
sheetName:
sheetNumber:
titleBlockFamilySymbol:
views:

Revit.Elements.Views.Sheet.InternalAddViewsToSheetView(System.Collections.Generic.IEnumerable{Autodesk.Revit.DB.View})
This method adds the collection of views to the existing ViewSheet and packs them
views:

Revit.Elements.Views.Sheet.InternalSetViewSheet(Autodesk.Revit.DB.ViewSheet)
Set the InternalViewSheet property and the associated element id and unique id
floor:

Revit.Elements.Views.Sheet.InternalSetSheetName(System.String)
Set the name of the sheet
name:

Revit.Elements.Views.Sheet.InternalSetSheetNumber(System.String)
Set the sheet number of the sheet
number:

Revit.Elements.Views.Sheet.InternalSetTitleBlock(Autodesk.Revit.DB.ElementId)
Set the title block id for the view
newTitleBlockId:

Revit.Elements.Views.Sheet.ByNameNumberTitleBlockAndViews(System.String,System.String,Revit.Elements.FamilySymbol,Revit.Elements.Views.View[])
Create a Revit Sheet by the sheet name, number, a title block FamilySymbol, and a collection of views.  This method will automatically
pack the views onto the sheet.
sheetName:
sheetNumber:
titleBlockFamilySymbol:
views:
Returns:

Revit.Elements.Views.Sheet.ByNameNumberTitleBlockAndView(System.String,System.String,Revit.Elements.FamilySymbol,Revit.Elements.Views.View)
Create a Revit Sheet by the sheet name, number, a title block FamilySymbol, and a collection of views.  This method will automatically
pack the view onto the sheet.
sheetName:
sheetNumber:
titleBlockFamilySymbol:
view:
Returns:

Revit.Elements.Views.Sheet.FromExisting(Autodesk.Revit.DB.ViewSheet,System.Boolean)
Create a View from a user selected Element.
view:
isRevitOwned:
Returns:

Revit.Elements.Views.Sheet.InternalViewSheet
An internal handle on the Revit element

Revit.Elements.Views.Sheet.InternalElement
Reference to the Element

Revit.Elements.Views.Sheet.SheetName
Get the SheetName of the Sheet

Revit.Elements.Views.Sheet.SheetNumber
Get the SheetNumber of the Sheet

Revit.Elements.Views.Sheet.Views
Get the Views on a Sheet